Revit 2024 API
StringParameterValue Constructor (String)
 Value constructor
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public StringParameterValue(
	string value
)
Visual Basic
Public Sub New ( _
	value As String _
)
Visual C++
public:
StringParameterValue(
	String^ value
)
Parameters
value
Type: System.String
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
StringParameterValue Class
StringParameterValue Overload
Autodesk.Revit.DB Namespace